MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FV16KM204/mcu.h
#define _CCP2CON2H_OCBEN_POSITION                0x00000009
#define _CCP2CON2H_OCBEN_MASK                    0x00000200
#define _CCP2CON2H_OCBEN_LENGTH                  0x00000001

#define _CCP2CON2H_OCCEN_POSITION                0x0000000A
#define _CCP2CON2H_OCCEN_MASK                    0x00000400
#define _CCP2CON2H_OCCEN_LENGTH                  0x00000001

#define _CCP2CON2H_OCDEN_POSITION                0x0000000B
#define _CCP2CON2H_OCDEN_MASK                    0x00000800
#define _CCP2CON2H_OCDEN_LENGTH                  0x00000001

#define _CCP2CON2H_OCEEN_POSITION                0x0000000C
#define _CCP2CON2H_OCEEN_MASK                    0x00001000
#define _CCP2CON2H_OCEEN_LENGTH                  0x00000001

#define _CCP2CON2H_OCFEN_POSITION                0x0000000D
#define _CCP2CON2H_OCFEN_MASK                    0x00002000
#define _CCP2CON2H_OCFEN_LENGTH                  0x00000001

#define _CCP2CON2H_OENSYNC_POSITION              0x0000000F
#define _CCP2CON2H_OENSYNC_MASK                  0x00008000
#define _CCP2CON2H_OENSYNC_LENGTH                0x00000001

#define _CCP2CON2H_ICS0_POSITION                 0x00000000
#define _CCP2CON2H_ICS0_MASK                     0x00000001
#define _CCP2CON2H_ICS0_LENGTH                   0x00000001

#define _CCP2CON2H_ICS1_POSITION                 0x00000001
#define _CCP2CON2H_ICS1_MASK                     0x00000002
#define _CCP2CON2H_ICS1_LENGTH                   0x00000001

#define _CCP2CON2H_ICS2_POSITION                 0x00000002
#define _CCP2CON2H_ICS2_MASK                     0x00000004
#define _CCP2CON2H_ICS2_LENGTH                   0x00000001

#define _CCP2CON2H_AUXOUT0_POSITION              0x00000003
#define _CCP2CON2H_AUXOUT0_MASK                  0x00000008
#define _CCP2CON2H_AUXOUT0_LENGTH                0x00000001

#define _CCP2CON2H_AUXOUT1_POSITION              0x00000004
#define _CCP2CON2H_AUXOUT1_MASK                  0x00000010
#define _CCP2CON2H_AUXOUT1_LENGTH                0x00000001

#define _CCP2CON2H_ICGSM0_POSITION               0x00000006
#define _CCP2CON2H_ICGSM0_MASK                   0x00000040
#define _CCP2CON2H_ICGSM0_LENGTH                 0x00000001

#define _CCP2CON2H_ICGSM1_POSITION               0x00000007
#define _CCP2CON2H_ICGSM1_MASK                   0x00000080
#define _CCP2CON2H_ICGSM1_LENGTH                 0x00000001

#define _CCP2CON2H_ICSEL_POSITION                0x00000000
#define _CCP2CON2H_ICSEL_MASK                    0x00000007
#define _CCP2CON2H_ICSEL_LENGTH                  0x00000003

#define _CCP2CON2H_ICSEL0_POSITION               0x00000000
#define _CCP2CON2H_ICSEL0_MASK                   0x00000001
#define _CCP2CON2H_ICSEL0_LENGTH                 0x00000001

#define _CCP2CON2H_ICSEL1_POSITION               0x00000001
#define _CCP2CON2H_ICSEL1_MASK                   0x00000002
#define _CCP2CON2H_ICSEL1_LENGTH                 0x00000001

#define _CCP2CON2H_ICSEL2_POSITION               0x00000002
#define _CCP2CON2H_ICSEL2_MASK                   0x00000004
#define _CCP2CON2H_ICSEL2_LENGTH                 0x00000001

#define _CCP2CON3L_DT_POSITION                   0x00000000
#define _CCP2CON3L_DT_MASK                       0x0000003F
#define _CCP2CON3L_DT_LENGTH                     0x00000006

#define _CCP2CON3L_DT0_POSITION                  0x00000000
#define _CCP2CON3L_DT0_MASK                      0x00000001
#define _CCP2CON3L_DT0_LENGTH                    0x00000001

#define _CCP2CON3L_DT1_POSITION                  0x00000001
#define _CCP2CON3L_DT1_MASK                      0x00000002
#define _CCP2CON3L_DT1_LENGTH                    0x00000001

#define _CCP2CON3L_DT2_POSITION                  0x00000002
#define _CCP2CON3L_DT2_MASK                      0x00000004
#define _CCP2CON3L_DT2_LENGTH                    0x00000001

#define _CCP2CON3L_DT3_POSITION                  0x00000003
#define _CCP2CON3L_DT3_MASK                      0x00000008
#define _CCP2CON3L_DT3_LENGTH                    0x00000001

#define _CCP2CON3L_DT4_POSITION                  0x00000004
#define _CCP2CON3L_DT4_MASK                      0x00000010
#define _CCP2CON3L_DT4_LENGTH                    0x00000001

#define _CCP2CON3L_DT5_POSITION                  0x00000005
#define _CCP2CON3L_DT5_MASK                      0x00000020
#define _CCP2CON3L_DT5_LENGTH                    0x00000001

#define _CCP2CON3H_PSSBDF_POSITION               0x00000000
#define _CCP2CON3H_PSSBDF_MASK                   0x00000003
#define _CCP2CON3H_PSSBDF_LENGTH                 0x00000002

#define _CCP2CON3H_PSSACE_POSITION               0x00000002
#define _CCP2CON3H_PSSACE_MASK                   0x0000000C
#define _CCP2CON3H_PSSACE_LENGTH                 0x00000002

#define _CCP2CON3H_POLBDF_POSITION               0x00000004
#define _CCP2CON3H_POLBDF_MASK                   0x00000010
#define _CCP2CON3H_POLBDF_LENGTH                 0x00000001

#define _CCP2CON3H_POLACE_POSITION               0x00000005
#define _CCP2CON3H_POLACE_MASK                   0x00000020
#define _CCP2CON3H_POLACE_LENGTH                 0x00000001

#define _CCP2CON3H_OUTM_POSITION                 0x00000008
#define _CCP2CON3H_OUTM_MASK                     0x00000700
#define _CCP2CON3H_OUTM_LENGTH                   0x00000003

#define _CCP2CON3H_OSCNT_POSITION                0x0000000C
#define _CCP2CON3H_OSCNT_MASK                    0x00007000
#define _CCP2CON3H_OSCNT_LENGTH                  0x00000003

#define _CCP2CON3H_OETRIG_POSITION               0x0000000F
#define _CCP2CON3H_OETRIG_MASK                   0x00008000
#define _CCP2CON3H_OETRIG_LENGTH                 0x00000001

#define _CCP2CON3H_PSSBDF0_POSITION              0x00000000
#define _CCP2CON3H_PSSBDF0_MASK                  0x00000001
#define _CCP2CON3H_PSSBDF0_LENGTH                0x00000001

#define _CCP2CON3H_PSSBDF1_POSITION              0x00000001
#define _CCP2CON3H_PSSBDF1_MASK                  0x00000002
#define _CCP2CON3H_PSSBDF1_LENGTH                0x00000001

#define _CCP2CON3H_PSSACE0_POSITION              0x00000002
#define _CCP2CON3H_PSSACE0_MASK                  0x00000004
#define _CCP2CON3H_PSSACE0_LENGTH                0x00000001

