MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FV16KM204/mcu.h
#define _ANSB_ANSB15_POSITION                    0x0000000F
#define _ANSB_ANSB15_MASK                        0x00008000
#define _ANSB_ANSB15_LENGTH                      0x00000001

#define _ANSB_ANSELB0_POSITION                   0x00000000
#define _ANSB_ANSELB0_MASK                       0x00000001
#define _ANSB_ANSELB0_LENGTH                     0x00000001

#define _ANSB_ANSELB1_POSITION                   0x00000001
#define _ANSB_ANSELB1_MASK                       0x00000002
#define _ANSB_ANSELB1_LENGTH                     0x00000001

#define _ANSB_ANSELB2_POSITION                   0x00000002
#define _ANSB_ANSELB2_MASK                       0x00000004
#define _ANSB_ANSELB2_LENGTH                     0x00000001

#define _ANSB_ANSELB3_POSITION                   0x00000003
#define _ANSB_ANSELB3_MASK                       0x00000008
#define _ANSB_ANSELB3_LENGTH                     0x00000001

#define _ANSB_ANSELB4_POSITION                   0x00000004
#define _ANSB_ANSELB4_MASK                       0x00000010
#define _ANSB_ANSELB4_LENGTH                     0x00000001

#define _ANSB_ANSELB5_POSITION                   0x00000005
#define _ANSB_ANSELB5_MASK                       0x00000020
#define _ANSB_ANSELB5_LENGTH                     0x00000001

#define _ANSB_ANSELB6_POSITION                   0x00000006
#define _ANSB_ANSELB6_MASK                       0x00000040
#define _ANSB_ANSELB6_LENGTH                     0x00000001

#define _ANSB_ANSELB7_POSITION                   0x00000007
#define _ANSB_ANSELB7_MASK                       0x00000080
#define _ANSB_ANSELB7_LENGTH                     0x00000001

#define _ANSB_ANSELB8_POSITION                   0x00000008
#define _ANSB_ANSELB8_MASK                       0x00000100
#define _ANSB_ANSELB8_LENGTH                     0x00000001

#define _ANSB_ANSELB9_POSITION                   0x00000009
#define _ANSB_ANSELB9_MASK                       0x00000200
#define _ANSB_ANSELB9_LENGTH                     0x00000001

#define _ANSB_ANSELB12_POSITION                  0x0000000C
#define _ANSB_ANSELB12_MASK                      0x00001000
#define _ANSB_ANSELB12_LENGTH                    0x00000001

#define _ANSB_ANSELB13_POSITION                  0x0000000D
#define _ANSB_ANSELB13_MASK                      0x00002000
#define _ANSB_ANSELB13_LENGTH                    0x00000001

#define _ANSB_ANSELB14_POSITION                  0x0000000E
#define _ANSB_ANSELB14_MASK                      0x00004000
#define _ANSB_ANSELB14_LENGTH                    0x00000001

#define _ANSB_ANSELB15_POSITION                  0x0000000F
#define _ANSB_ANSELB15_MASK                      0x00008000
#define _ANSB_ANSELB15_LENGTH                    0x00000001

#define _ANSELB_ANSB0_POSITION                   0x00000000
#define _ANSELB_ANSB0_MASK                       0x00000001
#define _ANSELB_ANSB0_LENGTH                     0x00000001

#define _ANSELB_ANSB1_POSITION                   0x00000001
#define _ANSELB_ANSB1_MASK                       0x00000002
#define _ANSELB_ANSB1_LENGTH                     0x00000001

#define _ANSELB_ANSB2_POSITION                   0x00000002
#define _ANSELB_ANSB2_MASK                       0x00000004
#define _ANSELB_ANSB2_LENGTH                     0x00000001

#define _ANSELB_ANSB3_POSITION                   0x00000003
#define _ANSELB_ANSB3_MASK                       0x00000008
#define _ANSELB_ANSB3_LENGTH                     0x00000001

#define _ANSELB_ANSB4_POSITION                   0x00000004
#define _ANSELB_ANSB4_MASK                       0x00000010
#define _ANSELB_ANSB4_LENGTH                     0x00000001

#define _ANSELB_ANSB5_POSITION                   0x00000005
#define _ANSELB_ANSB5_MASK                       0x00000020
#define _ANSELB_ANSB5_LENGTH                     0x00000001

#define _ANSELB_ANSB6_POSITION                   0x00000006
#define _ANSELB_ANSB6_MASK                       0x00000040
#define _ANSELB_ANSB6_LENGTH                     0x00000001

#define _ANSELB_ANSB7_POSITION                   0x00000007
#define _ANSELB_ANSB7_MASK                       0x00000080
#define _ANSELB_ANSB7_LENGTH                     0x00000001

#define _ANSELB_ANSB8_POSITION                   0x00000008
#define _ANSELB_ANSB8_MASK                       0x00000100
#define _ANSELB_ANSB8_LENGTH                     0x00000001

#define _ANSELB_ANSB9_POSITION                   0x00000009
#define _ANSELB_ANSB9_MASK                       0x00000200
#define _ANSELB_ANSB9_LENGTH                     0x00000001

#define _ANSELB_ANSB12_POSITION                  0x0000000C
#define _ANSELB_ANSB12_MASK                      0x00001000
#define _ANSELB_ANSB12_LENGTH                    0x00000001

#define _ANSELB_ANSB13_POSITION                  0x0000000D
#define _ANSELB_ANSB13_MASK                      0x00002000
#define _ANSELB_ANSB13_LENGTH                    0x00000001

#define _ANSELB_ANSB14_POSITION                  0x0000000E
#define _ANSELB_ANSB14_MASK                      0x00004000
#define _ANSELB_ANSB14_LENGTH                    0x00000001

#define _ANSELB_ANSB15_POSITION                  0x0000000F
#define _ANSELB_ANSB15_MASK                      0x00008000
#define _ANSELB_ANSB15_LENGTH                    0x00000001

#define _ANSELB_ANSELB0_POSITION                 0x00000000
#define _ANSELB_ANSELB0_MASK                     0x00000001
#define _ANSELB_ANSELB0_LENGTH                   0x00000001

#define _ANSELB_ANSELB1_POSITION                 0x00000001
#define _ANSELB_ANSELB1_MASK                     0x00000002
#define _ANSELB_ANSELB1_LENGTH                   0x00000001

#define _ANSELB_ANSELB2_POSITION                 0x00000002
#define _ANSELB_ANSELB2_MASK                     0x00000004
#define _ANSELB_ANSELB2_LENGTH                   0x00000001

#define _ANSELB_ANSELB3_POSITION                 0x00000003
#define _ANSELB_ANSELB3_MASK                     0x00000008
#define _ANSELB_ANSELB3_LENGTH                   0x00000001

#define _ANSELB_ANSELB4_POSITION                 0x00000004
#define _ANSELB_ANSELB4_MASK                     0x00000010
#define _ANSELB_ANSELB4_LENGTH                   0x00000001

#define _ANSELB_ANSELB5_POSITION                 0x00000005
#define _ANSELB_ANSELB5_MASK                     0x00000020
#define _ANSELB_ANSELB5_LENGTH                   0x00000001

